# 반응변수
TARGET = ['추정매출_건수']

# 설명변수
FEATURE = ['소득_금액_월평균', "지출_금액", "아파트_시가_평균", "상주인구", "생활인구", "직장인구"]

# 외생변수
EXOGENOUS = {
    '년도':[(2017, 2018, 2019), (2020, 2021, 2022, 2023)],
    '분기':[1, 2, 3, 4],
    '상권유형':['U', 'D', 'R', 'A'],
    '소득_구간':[3, 4, 5, 6, 7, 8, 9, 10]
    }

# 지출_금액
SUBFEATURE_CONSUME = [
    '지출_금액_식료품', '지출_금액_의류', '지출_금액_생활용품', '지출_금액_의료', '지출_금액_교통',
    '지출_금액_여가', '지출_금액_문화', '지출_금액_교육', '지출_금액_유흥'
    ]

# 상주인구
SUBFEATURE_RESIDENT = [
    '상주인구_성별_남성', '상주인구_성별_여성',
    '상주인구_연령대별_10대', '상주인구_연령대별_20대', '상주인구_연령대별_30대', '상주인구_연령대별_40대', '상주인구_연령대별_50대', '상주인구_연령대별_60이상',
    '상주인구_가구'
    ]

# 생활인구
SUBFEATURE_LIVING = [
    '생활인구_성별_남성', '생활인구_성별_여성',
    '생활인구_연령대별_10대', '생활인구_연령대별_20대', '생활인구_연령대별_30대', '생활인구_연령대별_40대', '생활인구_연령대별_50대', '생활인구_연령대별_60이상',
    '생활인구_시간대별_00-06', '생활인구_시간대별_06-11', '생활인구_시간대별_11-14', '생활인구_시간대별_14-17', '생활인구_시간대별_17-21', '생활인구_시간대별_21-24',
    '생활인구_요일별_월', '생활인구_요일별_화', '생활인구_요일별_수', '생활인구_요일별_목', '생활인구_요일별_금', '생활인구_요일별_토', '생활인구_요일별_일'
    ]

# 직장인구
SUBFEATURE_WORKING = [
    '직장인구_성별_남성', '직장인구_성별_여성',
    '직장인구_연령대별_10대', '직장인구_연령대별_20대', '직장인구_연령대별_30대', '직장인구_연령대별_40대', '직장인구_연령대별_50대', '직장인구_연령대별_60이상'
    ]